In [ ]:
## As a bonus to the SQL homework, we're asked to:
# 1)Create a histogram to visualize the most common salary ranges for employees.
# 2)Create a bar chart of average salary by title.

In [10]:
## Import the SQL database into Pandas
#(whew: see notes at bottom, got this fixed before hw due.)

In [ ]:
## we were given this code as a starting point::

# from sqlalchemy import create_engine
# engine = create_engine('postgresql://localhost:5432/<your_db_name>')
# connection = engine.connect()

In [40]:
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()
from sqlalchemy import Column, Integer, String, Float
from sqlalchemy import create_engine, inspect
from sqlalchemy.sql import func
import pandas as pd
import matplotlib
from matplotlib import style
style.use('seaborn')
import matplotlib.pyplot as plt

In [41]:
dbuser = 'postgres'
dbpassword = 'postgres'
dbhost = 'localhost'
dbport = '5432'
dbname= 'Pewlett_Hackard3'

engine = create_engine(f"postgres://{dbuser}:{dbpassword}@{dbhost}:{dbport}/{dbname}")
Base.metadata.create_all(engine)

In [42]:
print(f"postgres://{dbuser}:{dbpassword}@{dbhost}:{dbport}/{dbname}")

postgres://postgres:postgres@localhost:5432/Pewlett_Hackard3

In [43]:
connection = engine.connect()

In [44]:
inspector = inspect(engine)
inspector.get_table_names()

['Titles', 'Employees', 'Departments', 'Dept_Emp', 'Dept_Manager', 'Salaries']

In [45]:
# I know that I need values from Employees, Titles, and Salaries
# I will need to join Employees and Salaries on the emp_no column
# I will then nee to joing Titles to this combo on the emp_title_id column

# Taking a look at my tables:

In [46]:
engine.execute('SELECT "Employees".emp_no, "Employees".emp_title_id FROM "Employees" LIMIT 5').fetchall()

[(473302, 's0001'),
 (475053, 'e0002'),
 (57444, 'e0002'),
 (421786, 's0001'),
 (282238, 'e0003')]

In [47]:
engine.execute('SELECT * FROM "Titles" LIMIT 5').fetchall()

[('\ufefftitle_id', 'title'),
 ('s0001', 'Staff'),
 ('s0002', 'Senior Staff'),
 ('e0001', 'Assistant Engineer'),
 ('e0002', 'Engineer')]

In [48]:
engine.execute('SELECT * FROM "Salaries" LIMIT 5').fetchall()

[(10001, 60117),
 (10002, 65828),
 (10003, 40006),
 (10004, 40054),
 (10005, 78228)]

In [49]:
# I could perform the same exercise for inspecting the columns, but for the sake of this hw, I know what I need.

In [70]:
employees = engine.execute('SELECT "Employees".emp_no, "Salaries".salary, "Employees".emp_title_id\
                FROM "Employees"\
                JOIN "Salaries"\
                ON "Salaries".emp_no = "Employees".emp_no\
                JOIN "Titles"\
                ON "Titles".title_id = "Employees".emp_title_id\
                      ').fetchall()

#GROUP BY "Titles".title_id

In [72]:
df_employees = pd.DataFrame(employees)
df_employees

             0      1      2
0        10005  78228  s0001
1        10010  72488  e0002
2        10011  42365  s0001
3        10018  55881  e0003
4        10035  41538  e0003
...        ...    ...    ...
300019  499963  49383  e0003
300020  499972  41002  e0003
300021  499985  40000  s0001
300022  499987  52282  s0001
300023  499998  40000  s0001

[300024 rows x 3 columns]

In [80]:
#df_employees.groupby(['Employees.emp_no'])

In [ ]:
for emp_id in df_employees:

In [ ]:
### Some notes during tutor session

## seesions builds the query for you
## execute allows you to write out the raw query 


## look up having clause 


# SELECT * FROM Employees e
# LEFT JOIN Salaries s ON
# (e.emp_no == s.emp_no)
# LEFT JOIN title t ON
# (e.emp_title == t.title_id)
# ORDER BY

In [ ]:
# same_sporder = session.query(EA.sporder,
#                              EA.family,
#                              EA.genus,
#                              EA.species,
#                              NA.family,
#                              NA.genus,
#                              NA.species).filter(EA.sporder == NA.sporder).limit(10)

In [ ]:
# Loading some more examples here to pull from:

In [ ]:
# from sqlalchemy.orm import sessionmaker
# Session = sessionmaker(bind = engine)
# session = Session()

# for c, i in session.query(Customer, Invoice).filter(Customer.id == Invoice.custid).all():
#    print ("ID: {} Name: {} Invoice No: {} Amount: {}".format(c.id,c.name, i.invno, i.amount))

In [ ]:
## example from class

# stmt = session.query(
#    Invoice.custid, func.count('*').label('invoice_count')
# ).group_by(Invoice.custid).subquery()

In [ ]:
## When we were asked to run these lines of code on Thursday before class (SQL_1):
# conda install - c anaconda sqlite
# conda install - c anaconda sqlalchemy
# pip install psychopg2

# this last line gave me some errors, and the instructor asked to do a brew install of the same items 
# What I think we just found out yesterday that is created another user. 
# So now, I'm getting a password error every time I try to access pgAdmin from Jupyter. 
# We worked for about an hour to troubleshoot different ways of access, no luck.
# The solution that was brought forth was to uninstall and reinstall postgresQL / pgAdmin.
# This would obvious delete all the data / examples / work I've put into class until now,
# ...which I don't really want to do.

# I wanted to get the homework completed and submitted before attempting any of this,
# ...but unfortuately I (obviously) that part working for this bonus.

# I'm going to show a few steps here to prove my understanding of the exercise in hopes of a few points anyway:



# Got with Kirby/Justin TA's who finally figured it out.  I was using a password with % in it.
# I've learned this cannot be used when calling a url outside of the normal % function. 
# This created tons of problems... we also tried: 
#### from urllib.parse import quote_plus
# and placing the 'quote_plus()' around the password.  I think what we did wrong here was didn't do the same in the 
# url call. 
# after many many hours... it's working.  lessoned learned, just used postgres as password, ha.